AccumulationRegisters/РасчетыПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЛицевымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтимулирующийТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПерерасчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛицевыеСчетаВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЛицевыеСчетаВзаиморасчеты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЛицевымСчетам/Ext/RecordSetModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью набора записей.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЛицевыеСчетаСИзмененнымиВзаиморасчетами", ЛицевыеСчетаСИзмененнымиВзаиморасчетами());
	
	Если Не ДополнительныеСвойства.Свойство("ДляПроведения")
		Или Не ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Установка исключительной блокировки текущего набора записей регистратора.
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыПоЛицевымСчетам.НаборЗаписей");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Регистратор", Отбор.Регистратор.Значение);
	Блокировка.Заблокировать();
	
	Если НЕ СтруктураВременныеТаблицы.Свойство("ДвиженияРасчетыПоЛицевымСчетамИзменение") ИЛИ
		СтруктураВременныеТаблицы.Свойство("ДвиженияРасчетыПоЛицевымСчетамИзменение") И НЕ СтруктураВременныеТаблицы.ДвиженияРасчетыПоЛицевымСчетамИзменение Тогда
		
		// Если временная таблица "ДвиженияРасчетыПоЛицевымСчетамИзменение" не существует или не содержит записей
		// об изменении набора, значит набор записывается первый раз или для набора был выполнен контроль остатков.
		// Текущее состояние набора помещается во временную таблицу "ДвиженияРасчетыПоЛицевымСчетамПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно текущего.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетам.НомерСтроки КАК НомерСтроки,
		|	РасчетыПоЛицевымСчетам.Организация КАК Организация,
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет,
		|	РасчетыПоЛицевымСчетам.Услуга КАК Услуга,
		|	РасчетыПоЛицевымСчетам.МесяцНачисления КАК МесяцНачисления,
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РасчетыПоЛицевымСчетам.Сумма
		|		ИНАЧЕ -РасчетыПоЛицевымСчетам.Сумма
		|	КОНЕЦ КАК СуммаПередЗаписью
		|ПОМЕСТИТЬ ДвиженияРасчетыПоЛицевымСчетамПередЗаписью
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		|ГДЕ
		|	РасчетыПоЛицевымСчетам.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	Иначе
		
		// Если временная таблица "ДвиженияРасчетыПоЛицевымСчетамИзменение" существует и содержит записи
		// об изменении набора, значит набор записывается не первый раз и для набора не был выполнен контроль остатков.
		// Текущее состояние набора и текущее состояние изменений помещаются во временную таблцу "ДвиженияРасчетыПоЛицевымСчетамПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно первоначального.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация КАК Организация,
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет КАК ЛицевойСчет,
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга КАК Услуга,
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления КАК МесяцНачисления,
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью
		|ПОМЕСТИТЬ ДвиженияРасчетыПоЛицевымСчетамПередЗаписью
		|ИЗ
		|	ДвиженияРасчетыПоЛицевымСчетамИзменение КАК ДвиженияРасчетыПоЛицевымСчетамИзменение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетам.НомерСтроки,
		|	РасчетыПоЛицевымСчетам.Организация,
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет,
		|	РасчетыПоЛицевымСчетам.Услуга,
		|	РасчетыПоЛицевымСчетам.МесяцНачисления,
		|	ВЫБОР
		|		КОГДА РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА РасчетыПоЛицевымСчетам.Сумма
		|		ИНАЧЕ -РасчетыПоЛицевымСчетам.Сумма
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		|ГДЕ
		|	РасчетыПоЛицевымСчетам.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	КонецЕсли;
	
	// Временная таблица "ДвиженияРасчетыПоЛицевымСчетамИзменение" уничтожается
	// Удаляется информация о ее существовании.
	
	Если СтруктураВременныеТаблицы.Свойство("ДвиженияРасчетыПоЛицевымСчетамИзменение") Тогда
		
		Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияРасчетыПоЛицевымСчетамИзменение");
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		СтруктураВременныеТаблицы.Удалить("ДвиженияРасчетыПоЛицевымСчетамИзменение");
	
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ПриЗаписи набора записей.
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЛицевыеСчетаСИзмененнымиВзаиморасчетами") Тогда
		РегистрыСведений.ЛицевыеСчетаВзаиморасчеты.ОбновитьОстаткиВзаиморасчетов(ДополнительныеСвойства.ЛицевыеСчетаСИзмененнымиВзаиморасчетами);
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ДляПроведения")
		Или Не ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу "ДвиженияРасчетыПоЛицевымСчетамИзменение".
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МИНИМУМ(ДвиженияРасчетыПоЛицевымСчетамИзменение.НомерСтроки) КАК НомерСтроки,
	|	ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация КАК Организация,
	|	ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет КАК ЛицевойСчет,
	|	ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга КАК Услуга,
	|	ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления КАК МесяцНачисления,
	|	СУММА(ДвиженияРасчетыПоЛицевымСчетамИзменение.СуммаПередЗаписью) КАК СуммаПередЗаписью,
	|	СУММА(ДвиженияРасчетыПоЛицевымСчетамИзменение.СуммаИзменение) КАК СуммаИзменение,
	|	СУММА(ДвиженияРасчетыПоЛицевымСчетамИзменение.СуммаПриЗаписи) КАК СуммаПриЗаписи
	|ПОМЕСТИТЬ ДвиженияРасчетыПоЛицевымСчетамИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияРасчетыПоЛицевымСчетамПередЗаписью.НомерСтроки КАК НомерСтроки,
	|		ДвиженияРасчетыПоЛицевымСчетамПередЗаписью.Организация КАК Организация,
	|		ДвиженияРасчетыПоЛицевымСчетамПередЗаписью.ЛицевойСчет КАК ЛицевойСчет,
	|		ДвиженияРасчетыПоЛицевымСчетамПередЗаписью.Услуга КАК Услуга,
	|		ДвиженияРасчетыПоЛицевымСчетамПередЗаписью.МесяцНачисления КАК МесяцНачисления,
	|		ДвиженияРасчетыПоЛицевымСчетамПередЗаписью.СуммаПередЗаписью КАК СуммаПередЗаписью,
	|		ДвиженияРасчетыПоЛицевымСчетамПередЗаписью.СуммаПередЗаписью КАК СуммаИзменение,
	|		0 КАК СуммаПриЗаписи
	|	ИЗ
	|		ДвиженияРасчетыПоЛицевымСчетамПередЗаписью КАК ДвиженияРасчетыПоЛицевымСчетамПередЗаписью
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияРасчетыПоЛицевымСчетамПриЗаписи.НомерСтроки,
	|		ДвиженияРасчетыПоЛицевымСчетамПриЗаписи.Организация,
	|		ДвиженияРасчетыПоЛицевымСчетамПриЗаписи.ЛицевойСчет,
	|		ДвиженияРасчетыПоЛицевымСчетамПриЗаписи.Услуга,
	|		ДвиженияРасчетыПоЛицевымСчетамПриЗаписи.МесяцНачисления,
	|		0,
	|		ВЫБОР
	|			КОГДА ДвиженияРасчетыПоЛицевымСчетамПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ДвиженияРасчетыПоЛицевымСчетамПриЗаписи.Сумма
	|			ИНАЧЕ ДвиженияРасчетыПоЛицевымСчетамПриЗаписи.Сумма
	|		КОНЕЦ,
	|		ДвиженияРасчетыПоЛицевымСчетамПриЗаписи.Сумма
	|	ИЗ
	|		РегистрНакопления.РасчетыПоЛицевымСчетам КАК ДвиженияРасчетыПоЛицевымСчетамПриЗаписи
	|	ГДЕ
	|		ДвиженияРасчетыПоЛицевымСчетамПриЗаписи.Регистратор = &Регистратор) КАК ДвиженияРасчетыПоЛицевымСчетамИзменение
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияРасчетыПоЛицевымСчетамИзменение.Организация,
	|	ДвиженияРасчетыПоЛицевымСчетамИзменение.ЛицевойСчет,
	|	ДвиженияРасчетыПоЛицевымСчетамИзменение.Услуга,
	|	ДвиженияРасчетыПоЛицевымСчетамИзменение.МесяцНачисления
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДвиженияРасчетыПоЛицевымСчетамИзменение.СуммаИзменение) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ЛицевойСчет,
	|	Услуга,
	|	МесяцНачисления");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаИзРезультатаЗапроса.Следующий();
	
	// Новые изменения были помещены во временную таблицу "ДвиженияРасчетыПоЛицевымСчетамИзменение".
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияРасчетыПоЛицевымСчетамИзменение", ВыборкаИзРезультатаЗапроса.Количество > 0);
	
	// Временная таблица "ДвиженияРасчетыПоЛицевымСчетамПередЗаписью" уничтожается
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияРасчетыПоЛицевымСчетамПередЗаписью");
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры // ПриЗаписи()

Функция ЛицевыеСчетаСИзмененнымиВзаиморасчетами()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет КАК ЛицевойСчет
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		|ГДЕ
		|	РасчетыПоЛицевымСчетам.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Отбор.Регистратор.Значение);
	
	ЛицевыеСчетаПрошлогоНабора = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЛицевойСчет");
	ЛицевыеСчетаТекущегоНабора = ЭтотОбъект.ВыгрузитьКолонку("ЛицевойСчет");
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЛицевыеСчетаПрошлогоНабора, ЛицевыеСчетаТекущегоНабора, Истина);
	
	Возврат ЛицевыеСчетаПрошлогоНабора;
	
КонецФункции
